** Get aligned versions of the PC mosaics
#+begin_src python :results output
  from pathlib import Path
  from astropy.wcs import WCS
  from astropy.io import fits

  inpath = Path.home() / "Dropbox/JorgeBowshocks/HST"

  hdu = fits.open(inpath / "wcs_GO5469PCf656e_sharp_16.fits")[0]

  w = WCS(hdu)
  print(w)
#+end_src

#+RESULTS:
: WCS Keywords
: 
: Number of WCS axes: 2
: CTYPE : 'RA---TAN'  'DEC--TAN'  
: CRVAL : 83.82214183333333  -5.394832672222222  
: CRPIX : 811.0  987.0  
: CD1_1 CD1_2  : 8.959642e-06  8.79584e-06  
: CD2_1 CD2_2  : 8.79584e-06  -8.959642e-06  
: NAXIS : 1320  2060
*** DONE Easy method - use the WCS shifts we already have
CLOSED: [2022-05-26 Thu 08:33]

These are the WCS files I made when I did the alignment by hand

#+begin_src sh
grep CRPIX ../*.wcs
#+end_src

#+RESULTS:
| ../pc-mosaic-f547m-LV456.wcs:CRPIX1 | = | 810.7 |
| ../pc-mosaic-f547m-LV456.wcs:CRPIX2 | = | 987.3 |
| ../pc-mosaic-f656n-LV456.wcs:CRPIX1 | = |   811 |
| ../pc-mosaic-f656n-LV456.wcs:CRPIX2 | = | 987.5 |
| ../pc-mosaic-f658n-LV456.wcs:CRPIX1 | = | 810.5 |
| ../pc-mosaic-f658n-LV456.wcs:CRPIX2 | = | 987.5 |

Unfortunately, I cannot remember which ones I used for the 673 and 631 filters.  I will assume that they are the same as 547

#+name: wcs-crpix-pc
| f547m | 810.7 | 987.3 |
| f656n | 811.0 | 987.5 |
| f658n | 810.5 | 987.5 |
| f673n | 810.7 | 987.3 |
| f631n | 810.7 | 987.3 |

#+header: :var TAB=wcs-crpix-pc
#+begin_src python :results output
  from pathlib import Path
  from astropy.wcs import WCS
  from astropy.io import fits

  inpath = Path.home() / "Dropbox/JorgeBowshocks/HST"
  outpath = Path.cwd().parent / "data"

  for suff in "smooth", "sharp":
      for f, istring, jstring in TAB:
          hdu = fits.open(inpath / f"wcs_GO5469PC{f[:-1]}e_{suff}_16.fits")[0]
          hdu.header["CRPIX1"] = float(istring)
          hdu.header["CRPIX2"] = float(jstring)
          hdu.writeto(outpath / f"pcmos-{f}_{suff}_16.fits", overwrite=True)


#+end_src

#+RESULTS:

**** Find the sources in the images
+ For the ground truth we will use the Robberto 2005 data
+ I have copied the source identification script over to [[file:../scripts/find-sources.py]]
+ Trial run with the F631N filter to start with

#+begin_src sh :dir ../data :results verbatim
  python ../scripts/find-sources.py pcmos-f631n_sharp_16.fits 4.0 5.0
#+end_src

#+RESULTS:
: Source list saved to pcmos-f631n_sharp_16-sources-fwhm4.0-thresh5.ecsv
: Region file saved to pcmos-f631n_sharp_16-sources-fwhm4.0-thresh5.reg

+ Repeat for the other filters
#+begin_src sh :dir ../data :results verbatim
  for f in 547m 656n 658n 673n; do 
      python ../scripts/find-sources.py pcmos-f${f}_sharp_16.fits 4.0 5.0
  done
#+end_src

#+RESULTS:
: Source list saved to pcmos-f547m_sharp_16-sources-fwhm4.0-thresh5.ecsv
: Region file saved to pcmos-f547m_sharp_16-sources-fwhm4.0-thresh5.reg
: Source list saved to pcmos-f656n_sharp_16-sources-fwhm4.0-thresh5.ecsv
: Region file saved to pcmos-f656n_sharp_16-sources-fwhm4.0-thresh5.reg
: Source list saved to pcmos-f658n_sharp_16-sources-fwhm4.0-thresh5.ecsv
: Region file saved to pcmos-f658n_sharp_16-sources-fwhm4.0-thresh5.reg
: Source list saved to pcmos-f673n_sharp_16-sources-fwhm4.0-thresh5.ecsv
: Region file saved to pcmos-f673n_sharp_16-sources-fwhm4.0-thresh5.reg

*** Absolute fluxes and luminosities from PC images
- We use the equation that we derive below where we verify by comparison with the Bally intensities
  - F = 3.822e-17 DN for F631N
  - F = 6.86e-17 DN for F656N
- then we have the following
  |          |   R |       F | L/Lsun |
  |----------+-----+---------+--------|
  | 177-341W | 730 | 2.8e-14 | 1.5e-4 |
  |  182-413 | 338 | 1.3e-14 | 6.8e-5 |
  #+TBLFM: $3=3.822e-17 $2;s2::$4=$3 4 $pi 410**2 $pc**2 / $lsun ; s2
- Our total luminosity is three times higher than Bally's for 182-413, but this is because we are including the diffuse interior emission, as well as that near the surface of the disk

*** Comparing with Bally 1998
- Table 3 lists all the sources and notes which ones show oi emission from the disk, in their opinion
  - 161-328, 158-327 (LV6), 170-337, 160-328, 142-301, 184-427
  - 142-301 is not on the PC images, so we miss it
- Table 4 gives an [O I] intensity for both the disk and the i-front
  - There are 13 sources with oi disk intensities, as opposed to only 6 listed in Table 3
  - Some sample values from their table
    |    |    Name | I_d' |      I_d |   a_d |   b_d | A_pix |       F |      L |
    |----+---------+-----+---------+------+------+------+---------+--------|
    | 26 | 177-341 | 4.4 | 2.1e-13 | 0.18 | 0.09 | 24.6 | 1.1e-14 | 5.8e-5 |
    | 40 | 182-413 | 1.7 | 8.2e-14 | 0.18 | 0.09 | 24.6 | 4.2e-15 | 2.2e-5 |
    #+TBLFM: $4=$3 1e-16 / 0.0455**2 ; s2::$7=$pi $5 $6 / 0.0455**2 ;f1::$8=$3 $7 1e-16 ; s2::$9=4 $pi (410 $pc)**2 $8 / $lsun; s2
  - I_d' is directly from their table, and is in units of 1e-16 erg/s/cm2/PC pixel of size 0.0455 arcsec
  - I_d is converted to erg/s/cm2/sq.arcsec
  - a_d and b_d are the major minor semi-axes of disk in arcsec
  - A_pix is area of disk (\pi a b) in pixels
  - F is the total flux in erg/s/cm2
  - L is luminosity in Lsun
    - *Note that this gives a luminosity for 182-413 that is significantly smaller than what Giulia and Tom have in the paper, which seems to be about 3e-4*
    - Maybe there could be some additional correction for extinction in the neutral flow, but that is only going to be a factor of 3 or so
    - Although there is also the foreground extinction to the nebula to account for, so maybe the two extinctions could combine to give an order of magnitude increase. 
- There is a perfect description of the three different sources of oi emission in the context of 182-413:
  : The large teardrop-shaped object 182-413 (HST 10) has several extended [O I] emission components. The central region is seen as a prominent elongated silhouette in ionized species ([S II], [N II], and [O III]) and in Ha. However, this region is bright in the [O I] image. The teardrop-shaped outer boundary that is bright in Ha and in the ions is also bright in [O I]. Finally, there is diffuse [O I] emission in the entire projected interior of 182-413 that is several times fainter than the emission produced by the silhouette or the outer boundary.
  - Note that although it is true that the diffuse interior emission is fainter (lower surface brightness) than the i-front or the silhouette disk, it also extends over a greater area, so it is not insignificant in its contribution to the total flux


